HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_regdef.h
/** \brief Extra Path ${i} Image Cropping Output Horizontal Picture Size Register */
typedef struct _Ifx_CIF_EP_IC_1S_H_SIZE_Bits
{
    Ifx_UReg_32Bit H_SIZE:12;         /**< \brief [11:0] Horizontal Picture Size - H_SIZE (rw) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_EP_IC_1S_H_SIZE_Bits;

/** \brief Extra Path ${i} Image Cropping Current Output Horizontal Picture Size Shadow Register */
typedef struct _Ifx_CIF_EP_IC_1S_H_SIZE_SHD_Bits
{
    Ifx_UReg_32Bit H_SIZE_SHD:13;     /**< \brief [12:0] Horizontal Picture Size - H_SIZE_SHD (r) */
    Ifx_UReg_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_CIF_EP_IC_1S_H_SIZE_SHD_Bits;

/** \brief Extra Path ${i} Image Cropping Maximum Horizontal Displacement Register */
typedef struct _Ifx_CIF_EP_IC_1S_MAX_DX_Bits
{
    Ifx_UReg_32Bit MAX_DX:12;         /**< \brief [11:0] Maximum Horizontal Displacement - MAX_DX (rw) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_EP_IC_1S_MAX_DX_Bits;

/** \brief Extra Path ${i} Image Cropping Maximum Vertical Displacement Register */
typedef struct _Ifx_CIF_EP_IC_1S_MAX_DY_Bits
{
    Ifx_UReg_32Bit MAX_DY:12;         /**< \brief [11:0] Maximum Vertical Displacement - MAX_DY (rw) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_EP_IC_1S_MAX_DY_Bits;

/** \brief Extra Path ${i} Image Cropping Recenter Register */
typedef struct _Ifx_CIF_EP_IC_1S_RECENTER_Bits
{
    Ifx_UReg_32Bit RECENTER:3;        /**< \brief [2:0] Recenter - RECENTER (rw) */
    Ifx_UReg_32Bit reserved_3:29;     /**< \brief [31:3] \internal Reserved */
} Ifx_CIF_EP_IC_1S_RECENTER_Bits;

/** \brief Extra Path ${i} Image Cropping Vertical Offset Of Output Window Register */
typedef struct _Ifx_CIF_EP_IC_1S_V_OFFS_Bits
{
    Ifx_UReg_32Bit V_OFFS:12;         /**< \brief [11:0] Vertical Picture Offset - V_OFFS (rw) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_EP_IC_1S_V_OFFS_Bits;

/** \brief Extra Path ${i} Image Cropping Current Vertical Offset Of Output Window Shadow Register */
typedef struct _Ifx_CIF_EP_IC_1S_V_OFFS_SHD_Bits
{
    Ifx_UReg_32Bit V_OFFS_SHD:12;     /**< \brief [11:0] Vertical Picture Offset - V_OFFS_SHD (r) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_EP_IC_1S_V_OFFS_SHD_Bits;

/** \brief Extra Path ${i} Image Cropping Output Vertical Picture Size Register */
typedef struct _Ifx_CIF_EP_IC_1S_V_SIZE_Bits
{
    Ifx_UReg_32Bit V_SIZE:12;         /**< \brief [11:0] Vertical Picture Size - V_SIZE (rw) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_EP_IC_1S_V_SIZE_Bits;

/** \brief Extra Path ${i} Image Cropping Current Output Vertical Picture Size Shadow Register */
typedef struct _Ifx_CIF_EP_IC_1S_V_SIZE_SHD_Bits
{
    Ifx_UReg_32Bit V_SIZE_SHD:12;     /**< \brief [11:0] Vertical Picture Size - V_SIZE_SHD (r) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_EP_IC_1S_V_SIZE_SHD_Bits;

/** \brief CIF Internal Clock Control Register */
typedef struct _Ifx_CIF_ICCL_Bits
{
    Ifx_UReg_32Bit CIF_ISP_CLK_ENABLE:1;    /**< \brief [0:0] ISP processing clock enable - CIF_ISP_CLK_ENABLE (rw) */
    Ifx_UReg_32Bit reserved_1:4;      /**< \brief [4:1] \internal Reserved */
    Ifx_UReg_32Bit CIF_JPEG_CLK_ENABLE:1;    /**< \brief [5:5] JPEG encoder clock enable - CIF_JPEG_CLK_ENABLE (rw) */
    Ifx_UReg_32Bit CIF_MI_CLK_ENABLE:1;    /**< \brief [6:6] Memory interface clock enable - CIF_MI_CLK_ENABLE (rw) */
    Ifx_UReg_32Bit reserved_7:9;      /**< \brief [15:7] \internal Reserved */
    Ifx_UReg_32Bit CIF_WATCHDOG_CLK_ENABLE:1;    /**< \brief [16:16] Security Watchdog clock enable - CIF_WATCHDOG_CLK_ENABLE (rw) */
    Ifx_UReg_32Bit CIF_LIN_DSCALER_CLK_ENABLE:1;    /**< \brief [17:17] Linear Downscaler clock enable - CIF_LIN_DSCALER_CLK_ENABLE (rw) */
    Ifx_UReg_32Bit CIF_EXTRA_PATHS_CLK_ENABLE:1;    /**< \brief [18:18] Extra Paths clock enable - CIF_EXTRA_PATHS_CLK_ENABLE (rw) */
    Ifx_UReg_32Bit CIF_DEBUG_PATH_CLK_EN:1;    /**< \brief [19:19] Debug Path clock enable - CIF_DEBUG_PATH_CLK_EN (rw) */
    Ifx_UReg_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_ICCL_Bits;

/** \brief CIF Revision Identification Register */
typedef struct _Ifx_CIF_ID_Bits
{
    Ifx_UReg_32Bit MODREV:8;          /**< \brief [7:0] Module Revision Number - MODREV (r) */
    Ifx_UReg_32Bit MODTYPE:8;         /**< \brief [15:8] Module Type - MODTYPE (r) */
    Ifx_UReg_32Bit MODNUM:16;         /**< \brief [31:16] Module Number Value - MODNUM (r) */
} Ifx_CIF_ID_Bits;

/** \brief CIF Internal Reset Control Register */
typedef struct _Ifx_CIF_IRCL_Bits
{
    Ifx_UReg_32Bit CIF_ISP_SOFT_RST:1;    /**< \brief [0:0] Isp software reset - CIF_ISP_SOFT_RST (rw) */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit CIF_YCS_SOFT_RST:1;    /**< \brief [2:2] Y/C splitter software reset - CIF_YCS_SOFT_RST (rw) */
    Ifx_UReg_32Bit reserved_3:2;      /**< \brief [4:3] \internal Reserved */
    Ifx_UReg_32Bit CIF_JPEG_SOFT_RST:1;    /**< \brief [5:5] JPEG encoder software reset - CIF_JPEG_SOFT_RST (rw) */
    Ifx_UReg_32Bit CIF_MI_SOFT_RST:1;    /**< \brief [6:6] Memory interface software reset - CIF_MI_SOFT_RST (rw) */
    Ifx_UReg_32Bit CIF_GLOBAL_RST:1;    /**< \brief [7:7] Soft reset of entire CIF - CIF_GLOBAL_RST (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit CIF_WATCHDOG_RST:1;    /**< \brief [16:16] Securtiy Watchdog software reset - CIF_WATCHDOG_RST (rw) */
    Ifx_UReg_32Bit CIF_LIN_DSCALER_RST:1;    /**< \brief [17:17] Linear Downscaler software reset - CIF_LIN_DSCALER_RST (rw) */
    Ifx_UReg_32Bit CIF_EXTRA_PATHS_RST:1;    /**< \brief [18:18] Extra Paths software reset - CIF_EXTRA_PATHS_RST (rw) */
    Ifx_UReg_32Bit CIF_DEBUG_PATH_RST:1;    /**< \brief [19:19] Debug Path software reset - CIF_DEBUG_PATH_RST (rw) */
    Ifx_UReg_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_IRCL_Bits;

