HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_regdef.h
/** \brief JPE Huffman DC Table 0 Length Register */
typedef struct _Ifx_CIF_JPE_TDC0_LEN_Bits
{
    Ifx_UReg_32Bit TDC0_LEN:8;        /**< \brief [7:0] DC Table 0 Length - TDC0_LEN (rw) */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_CIF_JPE_TDC0_LEN_Bits;

/** \brief JPE Huffman DC Table 1 Length Register */
typedef struct _Ifx_CIF_JPE_TDC1_LEN_Bits
{
    Ifx_UReg_32Bit TDC1_LEN:8;        /**< \brief [7:0] DC Table 1 Length - TDC1_LEN (rw) */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_CIF_JPE_TDC1_LEN_Bits;

/** \brief Q- table Selector 1, Quant. Table For U Component */
typedef struct _Ifx_CIF_JPE_TQ_U_SELECT_Bits
{
    Ifx_UReg_32Bit TQ1_SELECT:2;      /**< \brief [1:0] Q-Table Selector U - TQ1_SELECT (rw) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_CIF_JPE_TQ_U_SELECT_Bits;

/** \brief Q- table Selector 2 Quant Table For V Component */
typedef struct _Ifx_CIF_JPE_TQ_V_SELECT_Bits
{
    Ifx_UReg_32Bit TQ2_SELECT:2;      /**< \brief [1:0] Q-Table Selector V - TQ2_SELECT (rw) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_CIF_JPE_TQ_V_SELECT_Bits;

/** \brief Q- table Selector 0, Quant. Table For Y Component */
typedef struct _Ifx_CIF_JPE_TQ_Y_SELECT_Bits
{
    Ifx_UReg_32Bit TQ0_SELECT:2;      /**< \brief [1:0] Q-Table Selector Y - TQ0_SELECT (rw) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_CIF_JPE_TQ_Y_SELECT_Bits;

/** \brief JPE Y Value Scaling Control Register */
typedef struct _Ifx_CIF_JPE_Y_SCALE_EN_Bits
{
    Ifx_UReg_32Bit Y_SCALE_EN:1;      /**< \brief [0:0] Y scale flag - Y_SCALE_EN (rw) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_JPE_Y_SCALE_EN_Bits;

/** \brief Linear Downscaler Control Register */
typedef struct _Ifx_CIF_LDS_CTRL_Bits
{
    Ifx_UReg_32Bit LDS_V_EN:1;        /**< \brief [0:0] Vertical scaling enable - LDS_V_EN (rw) */
    Ifx_UReg_32Bit LDS_H_EN:1;        /**< \brief [1:1] Horizontal scaling enable - LDS_H_EN (rw) */
    Ifx_UReg_32Bit reserved_2:2;      /**< \brief [3:2] \internal Reserved */
    Ifx_UReg_32Bit LDS_V_MODE:2;      /**< \brief [5:4] Vertical scaling mode - LDS_V_MODE (rw) */
    Ifx_UReg_32Bit reserved_6:2;      /**< \brief [7:6] \internal Reserved */
    Ifx_UReg_32Bit LDS_H_MODE:2;      /**< \brief [9:8] Horizontal scaling mode - LDS_H_MODE (rw) */
    Ifx_UReg_32Bit reserved_10:22;    /**< \brief [31:10] \internal Reserved */
} Ifx_CIF_LDS_CTRL_Bits;

/** \brief Linear Downscaler Factor Register */
typedef struct _Ifx_CIF_LDS_FAC_Bits
{
    Ifx_UReg_32Bit LDS_V_FAC:8;       /**< \brief [7:0] Vertical scaling factor - LDS_V_FAC (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit LDS_H_FAC:8;       /**< \brief [23:16] Horizontal scaling factor - LDS_H_FAC (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_LDS_FAC_Bits;

/** \brief Memory Interface Base Address for Extra Path ${j} Data Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit EP_BASE_AD_INIT:30;    /**< \brief [31:2] Extra Path Base Address Init - EP_BASE_AD_INIT (rw) */
} Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits;

/** \brief Memory Interface Base Address Shadow Register for Extra Path ${j} Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit EP_BASE_AD:30;     /**< \brief [31:2] Extra Path Base Address - EP_BASE_AD (r) */
} Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits;

/** \brief Memory Interface Extra Path ${j} Control Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_CTRL_Bits
{
    Ifx_UReg_32Bit EP_ENABLE:1;       /**< \brief [0:0] Enables enable ep picture data path - EP_ENABLE (rw) */
    Ifx_UReg_32Bit reserved_1:6;      /**< \brief [6:1] \internal Reserved */
    Ifx_UReg_32Bit BYTE_SWAP:1;       /**< \brief [7:7] Byte Swap Enable - BYTE_SWAP (rw) */
    Ifx_UReg_32Bit reserved_8:12;     /**< \brief [19:8] \internal Reserved */
    Ifx_UReg_32Bit INIT_BASE_EN:1;    /**< \brief [20:20] Init Base Address Enable - INIT_BASE_EN (rw) */
    Ifx_UReg_32Bit INIT_OFFSET_EN:1;    /**< \brief [21:21] Init Offset Counter Enable - INIT_OFFSET_EN (rw) */
    Ifx_UReg_32Bit EP_WRITE_FORMAT:2;    /**< \brief [23:22] Extra Path Write Format - EP_WRITE_FORMAT (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_CTRL_Bits;

/** \brief Memory Interface Extra Path ${j} Control Internal Shadow Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits
{
    Ifx_UReg_32Bit EP_ENABLE_IN:1;    /**< \brief [0:0] Extra Path In Enable - EP_ENABLE_IN (r) */
    Ifx_UReg_32Bit reserved_1:15;     /**< \brief [15:1] \internal Reserved */
    Ifx_UReg_32Bit EP_ENABLE_OUT:1;    /**< \brief [16:16] Extra Path Out Enable - EP_ENABLE_OUT (r) */
    Ifx_UReg_32Bit reserved_17:15;    /**< \brief [31:17] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits;

/** \brief Memory Interface Extra Path ${j} Control Register For Address Init And Skip Function Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_INIT_Bits
{
    Ifx_UReg_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_UReg_32Bit MI_EP_SKIP:1;      /**< \brief [2:2] Skip Picture - MI_EP_SKIP (w) */
    Ifx_UReg_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_UReg_32Bit MI_EP_CFG_UPD:1;    /**< \brief [4:4] Forced Configuration Update - MI_EP_CFG_UPD (w) */
    Ifx_UReg_32Bit reserved_5:27;     /**< \brief [31:5] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_INIT_Bits;

/** \brief Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit EP_IRQ_OFFS_INIT:22;    /**< \brief [23:2] Extra Path Y IRQ Offset Init - EP_IRQ_OFFS_INIT (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits;

/** \brief Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path ${j} Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit EP_IRQ_OFFS:22;    /**< \brief [23:2] Extra Path IRQ Offset - EP_IRQ_OFFS (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits;

/** \brief Memory Interface Offset Counter Init Value For Extra Path ${j} Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit EP_OFFS_CNT_INIT:22;    /**< \brief [23:2] Extra Path Offset Counter Init - EP_OFFS_CNT_INIT (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits;

/** \brief Memory Interface Current Offset Counter of Extra Path ${j} Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit EP_OFFS_CNT:22;    /**< \brief [23:2] Extra Path Y Offset Counter - EP_OFFS_CNT (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits;

/** \brief Memory Interface Offset Counter Start Value for Extra Path ${j} Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit EP_OFFS_CNT_START:22;    /**< \brief [23:2] Extra Path Offset Counter Start - EP_OFFS_CNT_START (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits;

