HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_regdef.h
/** \brief MI Extra Path Masked Interrupt Status Register */
typedef struct _Ifx_CIF_MIEP_MIS_Bits
{
    Ifx_UReg_32Bit FRAME_END_EP_1:1;    /**< \brief [0:0] Extra Path 1 Frame End - FRAME_END_EP_1 (r) */
    Ifx_UReg_32Bit FILL_EP_1:1;       /**< \brief [1:1] Fill Extra Path 1 - FILL_EP_1 (r) */
    Ifx_UReg_32Bit WRAP_EP_1:1;       /**< \brief [2:2] Wrap Extra Path 1 - WRAP_EP_1 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_1:1;    /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 - MBLK_LINE_EP_1 (r) */
    Ifx_UReg_32Bit FRAME_END_EP_2:1;    /**< \brief [4:4] Extra Path 2 Frame End - FRAME_END_EP_2 (r) */
    Ifx_UReg_32Bit FILL_EP_2:1;       /**< \brief [5:5] Fill Extra Path 2 - FILL_EP_2 (r) */
    Ifx_UReg_32Bit WRAP_EP_2:1;       /**< \brief [6:6] Wrap Extra Path 2 - WRAP_EP_2 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_2:1;    /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 - MBLK_LINE_EP_2 (r) */
    Ifx_UReg_32Bit FRAME_END_EP_3:1;    /**< \brief [8:8] Extra Path 3 Frame End - FRAME_END_EP_3 (r) */
    Ifx_UReg_32Bit FILL_EP_3:1;       /**< \brief [9:9] Fill Extra Path 3 - FILL_EP_3 (r) */
    Ifx_UReg_32Bit WRAP_EP_3:1;       /**< \brief [10:10] Wrap Extra Path 3 - WRAP_EP_3 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_3:1;    /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 - MBLK_LINE_EP_3 (r) */
    Ifx_UReg_32Bit FRAME_END_EP_4:1;    /**< \brief [12:12] Extra Path 4 Frame End - FRAME_END_EP_4 (r) */
    Ifx_UReg_32Bit FILL_EP_4:1;       /**< \brief [13:13] Fill Extra Path 4 - FILL_EP_4 (r) */
    Ifx_UReg_32Bit WRAP_EP_4:1;       /**< \brief [14:14] Wrap Extra Path 4 - WRAP_EP_4 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_4:1;    /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 - MBLK_LINE_EP_4 (r) */
    Ifx_UReg_32Bit FRAME_END_EP_5:1;    /**< \brief [16:16] Extra Path 5 Frame End - FRAME_END_EP_5 (r) */
    Ifx_UReg_32Bit FILL_EP_5:1;       /**< \brief [17:17] Fill Extra Path 5 - FILL_EP_5 (r) */
    Ifx_UReg_32Bit WRAP_EP_5:1;       /**< \brief [18:18] Wrap Extra Path 5 - WRAP_EP_5 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_5:1;    /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 - MBLK_LINE_EP_5 (r) */
    Ifx_UReg_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_MIEP_MIS_Bits;

/** \brief MI Extra Path Raw Interrupt Status Register */
typedef struct _Ifx_CIF_MIEP_RIS_Bits
{
    Ifx_UReg_32Bit FRAME_END_EP_1:1;    /**< \brief [0:0] Extra Path 1 Frame End - FRAME_END_EP_1 (r) */
    Ifx_UReg_32Bit FILL_EP_1:1;       /**< \brief [1:1] Fill Extra Path 1 - FILL_EP_1 (r) */
    Ifx_UReg_32Bit WRAP_EP_1:1;       /**< \brief [2:2] Wrap Extra Path 1 - WRAP_EP_1 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_1:1;    /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 - MBLK_LINE_EP_1 (r) */
    Ifx_UReg_32Bit FRAME_END_EP_2:1;    /**< \brief [4:4] Extra Path 2 Frame End - FRAME_END_EP_2 (r) */
    Ifx_UReg_32Bit FILL_EP_2:1;       /**< \brief [5:5] Fill Extra Path 2 - FILL_EP_2 (r) */
    Ifx_UReg_32Bit WRAP_EP_2:1;       /**< \brief [6:6] Wrap Extra Path 2 - WRAP_EP_2 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_2:1;    /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 - MBLK_LINE_EP_2 (r) */
    Ifx_UReg_32Bit FRAME_END_EP_3:1;    /**< \brief [8:8] Extra Path 3 Frame End - FRAME_END_EP_3 (r) */
    Ifx_UReg_32Bit FILL_EP_3:1;       /**< \brief [9:9] Fill Extra Path 3 - FILL_EP_3 (r) */
    Ifx_UReg_32Bit WRAP_EP_3:1;       /**< \brief [10:10] Wrap Extra Path 3 - WRAP_EP_3 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_3:1;    /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 - MBLK_LINE_EP_3 (r) */
    Ifx_UReg_32Bit FRAME_END_EP_4:1;    /**< \brief [12:12] Extra Path 4 Frame End - FRAME_END_EP_4 (r) */
    Ifx_UReg_32Bit FILL_EP_4:1;       /**< \brief [13:13] Fill Extra Path 4 - FILL_EP_4 (r) */
    Ifx_UReg_32Bit WRAP_EP_4:1;       /**< \brief [14:14] Wrap Extra Path 4 - WRAP_EP_4 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_4:1;    /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 - MBLK_LINE_EP_4 (r) */
    Ifx_UReg_32Bit FRAME_END_EP_5:1;    /**< \brief [16:16] Extra Path 5 Frame End - FRAME_END_EP_5 (r) */
    Ifx_UReg_32Bit FILL_EP_5:1;       /**< \brief [17:17] Fill Extra Path 5 - FILL_EP_5 (r) */
    Ifx_UReg_32Bit WRAP_EP_5:1;       /**< \brief [18:18] Wrap Extra Path 5 - WRAP_EP_5 (r) */
    Ifx_UReg_32Bit MBLK_LINE_EP_5:1;    /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 - MBLK_LINE_EP_5 (r) */
    Ifx_UReg_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_MIEP_RIS_Bits;

/** \brief Extra Path Error Register */
typedef struct _Ifx_CIF_MIEP_STA_ERR_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit EP_1_IC_SIZE_ERR:1;    /**< \brief [1:1] Size error is generated in Extra Path 1 image cropping submodule - EP_1_IC_SIZE_ERR (r) */
    Ifx_UReg_32Bit EP_2_IC_SIZE_ERR:1;    /**< \brief [2:2] Size error is generated in Extra Path 2 image cropping submodule - EP_2_IC_SIZE_ERR (r) */
    Ifx_UReg_32Bit EP_3_IC_SIZE_ERR:1;    /**< \brief [3:3] Size error is generated in Extra Path 3 image cropping submodule - EP_3_IC_SIZE_ERR (r) */
    Ifx_UReg_32Bit EP_4_IC_SIZE_ERR:1;    /**< \brief [4:4] Size error is generated in Extra Path 4 image cropping submodule - EP_4_IC_SIZE_ERR (r) */
    Ifx_UReg_32Bit EP_5_IC_SIZE_ERR:1;    /**< \brief [5:5] Size error is generated in Extra Path 5 image cropping submodule - EP_5_IC_SIZE_ERR (r) */
    Ifx_UReg_32Bit reserved_6:11;     /**< \brief [16:6] \internal Reserved */
    Ifx_UReg_32Bit EP_1_FIFO_FULL:1;    /**< \brief [17:17] Extra Path 1 FIFO Full - EP_1_FIFO_FULL (r) */
    Ifx_UReg_32Bit EP_2_FIFO_FULL:1;    /**< \brief [18:18] Extra Path 2 FIFO Full - EP_2_FIFO_FULL (r) */
    Ifx_UReg_32Bit EP_3_FIFO_FULL:1;    /**< \brief [19:19] Extra Path 3 FIFO Full - EP_3_FIFO_FULL (r) */
    Ifx_UReg_32Bit EP_4_FIFO_FULL:1;    /**< \brief [20:20] Extra Path 4 FIFO Full - EP_4_FIFO_FULL (r) */
    Ifx_UReg_32Bit EP_5_FIFO_FULL:1;    /**< \brief [21:21] Extra Path 5 FIFO Full - EP_5_FIFO_FULL (r) */
    Ifx_UReg_32Bit reserved_22:10;    /**< \brief [31:22] \internal Reserved */
} Ifx_CIF_MIEP_STA_ERR_Bits;

/** \brief Extra Path Status Error Clear Register */
typedef struct _Ifx_CIF_MIEP_STA_ERR_CLR_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit EP_1_IC_SIZE_ERR_CLR:1;    /**< \brief [1:1] Size error is cleared - EP_1_IC_SIZE_ERR_CLR (w) */
    Ifx_UReg_32Bit EP_2_IC_SIZE_ERR_CLR:1;    /**< \brief [2:2] Size error is cleared - EP_2_IC_SIZE_ERR_CLR (w) */
    Ifx_UReg_32Bit EP_3_IC_SIZE_ERR_CLR:1;    /**< \brief [3:3] Size error is cleared - EP_3_IC_SIZE_ERR_CLR (w) */
    Ifx_UReg_32Bit EP_4_IC_SIZE_ERR_CLR:1;    /**< \brief [4:4] Size error is cleared - EP_4_IC_SIZE_ERR_CLR (w) */
    Ifx_UReg_32Bit EP_5_IC_SIZE_ERR_CLR:1;    /**< \brief [5:5] Size error is cleared - EP_5_IC_SIZE_ERR_CLR (w) */
    Ifx_UReg_32Bit reserved_6:26;     /**< \brief [31:6] \internal Reserved */
} Ifx_CIF_MIEP_STA_ERR_CLR_Bits;

/** \brief Memory Interface Counter Value of JPEG or RAW Data Bytes Register */
typedef struct _Ifx_CIF_MI_BYTE_CNT_Bits
{
    Ifx_UReg_32Bit BYTE_CNT:24;       /**< \brief [23:0] Byte Count - BYTE_CNT (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_BYTE_CNT_Bits;

/** \brief Memory Interface Global Control Register */
typedef struct _Ifx_CIF_MI_CTRL_Bits
{
    Ifx_UReg_32Bit MP_ENABLE:1;       /**< \brief [0:0] Enables main picture data path, YCbCr mode - MP_ENABLE (rw) */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit JPEG_ENABLE:1;     /**< \brief [2:2] Enables JPEG mode - JPEG_ENABLE (rw) */
    Ifx_UReg_32Bit RAW_ENABLE:1;      /**< \brief [3:3] Enables RAW mode - RAW_ENABLE (rw) */
    Ifx_UReg_32Bit reserved_4:3;      /**< \brief [6:4] \internal Reserved */
    Ifx_UReg_32Bit BYTE_SWAP:1;       /**< \brief [7:7] Byte Swap Enable - BYTE_SWAP (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit BURST_LEN_LUM:1;    /**< \brief [16:16] Luminance Burst Length - BURST_LEN_LUM (rw) */
    Ifx_UReg_32Bit reserved_17:1;     /**< \brief [17:17] \internal Reserved */
    Ifx_UReg_32Bit BURST_LEN_CHROM:1;    /**< \brief [18:18] Chrominance Burst Length - BURST_LEN_CHROM (rw) */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit INIT_BASE_EN:1;    /**< \brief [20:20] Init Base Address Enable - INIT_BASE_EN (rw) */
    Ifx_UReg_32Bit INIT_OFFSET_EN:1;    /**< \brief [21:21] Init Offset Counter Enable - INIT_OFFSET_EN (rw) */
    Ifx_UReg_32Bit MP_WRITE_FORMAT:2;    /**< \brief [23:22] Main Picture YCbCr Write Format - MP_WRITE_FORMAT (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_CTRL_Bits;

