HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_regdef.h
/** \brief Memory Interface Base Address For Main Picture Y Component, JPEG or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_BASE_AD_INIT:30;    /**< \brief [31:2] Main Picture Y Base Address Init - MP_Y_BASE_AD_INIT (rw) */
} Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits;

/** \brief Memory Interface Base Address Shadow Register For Main Picture Y Component, JPEG Register */
typedef struct _Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_BASE_AD:30;    /**< \brief [31:2] Main Picture Y Base Address - MP_Y_BASE_AD (r) */
} Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits;

/** \brief Memory Interface Fill Level Interrupt Offset Value For Main Picture Y, JPEG or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_IRQ_OFFS_INIT:22;    /**< \brief [23:2] Main Picture Y IRQ Offset Init - MP_Y_IRQ_OFFS_INIT (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits;

/** \brief Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Main Picture Y Register */
typedef struct _Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_IRQ_OFFS:22;    /**< \brief [23:2] Main Picture Y IRQ Offset - MP_Y_IRQ_OFFS (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits;

/** \brief Memory Interface Offset Counter Init Value For Main Picture Y, JPEG or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_OFFS_CNT_INIT:22;    /**< \brief [23:2] Main Picture Y Offset Counter Init - MP_Y_OFFS_CNT_INIT (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits;

/** \brief Memory Interface Current Offset Counter of Main Picture Y Component JPEG or RAW Register */
typedef struct _Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_OFFS_CNT:22;    /**< \brief [23:2] Main Picture Y Offset Counter - MP_Y_OFFS_CNT (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits;

/** \brief Memory Interface Offset Counter Start Value For Main Picture Y, JPEG or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_OFFS_CNT_START:22;    /**< \brief [23:2] Main Picture Y Offset Counter Start - MP_Y_OFFS_CNT_START (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits;

/** \brief Memory Interface Size of main picture Y component, JPEG or RAW data Register */
typedef struct _Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_SIZE_INIT:22;    /**< \brief [23:2] Main Picture Y Size Init - MP_Y_SIZE_INIT (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits;

/** \brief Memory Interface Size Shadow Register of Main Picture Y Component,JPEG or RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits
{
    Ifx_UReg_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). - FIXED_TO_00 (r) */
    Ifx_UReg_32Bit MP_Y_SIZE:22;      /**< \brief [23:2] Main Picture Y Size - MP_Y_SIZE (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits;

/** \brief MI Raw Interrupt Status Register */
typedef struct _Ifx_CIF_MI_RIS_Bits
{
    Ifx_UReg_32Bit MP_FRAME_END:1;    /**< \brief [0:0] Main Picture Frame End - MP_FRAME_END (r) */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit MBLK_LINE:1;       /**< \brief [2:2] Macro Block Line Interrupt - MBLK_LINE (r) */
    Ifx_UReg_32Bit FILL_MP_Y:1;       /**< \brief [3:3] Fill Main Picture Y - FILL_MP_Y (r) */
    Ifx_UReg_32Bit WRAP_MP_Y:1;       /**< \brief [4:4] Wrap Main Picture Y - WRAP_MP_Y (r) */
    Ifx_UReg_32Bit WRAP_MP_CB:1;      /**< \brief [5:5] Wrap Main Picture Cb - WRAP_MP_CB (r) */
    Ifx_UReg_32Bit WRAP_MP_CR:1;      /**< \brief [6:6] Wrap Main Picture Cr - WRAP_MP_CR (r) */
    Ifx_UReg_32Bit reserved_7:3;      /**< \brief [9:7] \internal Reserved */
    Ifx_UReg_32Bit BUS_ERROR:1;       /**< \brief [10:10] Bus Error - BUS_ERROR (r) */
    Ifx_UReg_32Bit reserved_11:21;    /**< \brief [31:11] \internal Reserved */
} Ifx_CIF_MI_RIS_Bits;

/** \brief MI Status Register */
typedef struct _Ifx_CIF_MI_STATUS_Bits
{
    Ifx_UReg_32Bit MP_Y_FIFO_FULL:1;    /**< \brief [0:0] Main Picture Y FIFO Full - MP_Y_FIFO_FULL (r) */
    Ifx_UReg_32Bit MP_CB_FIFO_FULL:1;    /**< \brief [1:1] Main Picture Cb FIFO Full - MP_CB_FIFO_FULL (r) */
    Ifx_UReg_32Bit MP_CR_FIFO_FULL:1;    /**< \brief [2:2] Main Picture Cr FIFO Full - MP_CR_FIFO_FULL (r) */
    Ifx_UReg_32Bit reserved_3:5;      /**< \brief [7:3] \internal Reserved */
    Ifx_UReg_32Bit BUS_WRITE_ERROR:1;    /**< \brief [8:8] Bus Write Error - BUS_WRITE_ERROR (r) */
    Ifx_UReg_32Bit reserved_9:23;     /**< \brief [31:9] \internal Reserved */
} Ifx_CIF_MI_STATUS_Bits;

/** \brief MI Status Clear Register */
typedef struct _Ifx_CIF_MI_STATUS_CLR_Bits
{
    Ifx_UReg_32Bit MP_Y_FIFO_FULL:1;    /**< \brief [0:0] Main Picture Y FIFO Full - MP_Y_FIFO_FULL (w) */
    Ifx_UReg_32Bit MP_CB_FIFO_FULL:1;    /**< \brief [1:1] Main Picture Cb FIFO Full - MP_CB_FIFO_FULL (w) */
    Ifx_UReg_32Bit MP_CR_FIFO_FULL:1;    /**< \brief [2:2] Main Picture Cr FIFO Full - MP_CR_FIFO_FULL (w) */
    Ifx_UReg_32Bit reserved_3:5;      /**< \brief [7:3] \internal Reserved */
    Ifx_UReg_32Bit BUS_WRITE_ERROR:1;    /**< \brief [8:8] Bus Write Error - BUS_WRITE_ERROR (w) */
    Ifx_UReg_32Bit reserved_9:15;     /**< \brief [23:9] \internal Reserved */
    Ifx_UReg_32Bit EP_1_FIFO_FULL:1;    /**< \brief [24:24] Extra Path 1 FIFO Full - EP_1_FIFO_FULL (w) */
    Ifx_UReg_32Bit EP_2_FIFO_FULL:1;    /**< \brief [25:25] Extra Path 2 FIFO Full - EP_2_FIFO_FULL (w) */
    Ifx_UReg_32Bit EP_3_FIFO_FULL:1;    /**< \brief [26:26] Extra Path 3 FIFO Full - EP_3_FIFO_FULL (w) */
    Ifx_UReg_32Bit EP_4_FIFO_FULL:1;    /**< \brief [27:27] Extra Path 4 FIFO Full - EP_4_FIFO_FULL (w) */
    Ifx_UReg_32Bit EP_5_FIFO_FULL:1;    /**< \brief [28:28] Extra Path 5 FIFO Full - EP_5_FIFO_FULL (w) */
    Ifx_UReg_32Bit reserved_29:3;     /**< \brief [31:29] \internal Reserved */
} Ifx_CIF_MI_STATUS_CLR_Bits;

/** \brief Watchdog Control Register */
typedef struct _Ifx_CIF_WD_CTRL_Bits
{
    Ifx_UReg_32Bit WD_EN:1;           /**< \brief [0:0] Enable Security Watchdog - WD_EN (rw) */
    Ifx_UReg_32Bit RST_H_CNT:1;       /**< \brief [1:1] Reset Horizontal Counter - RST_H_CNT (w) */
    Ifx_UReg_32Bit RST_V_CNT:1;       /**< \brief [2:2] Reset Vertical Counter - RST_V_CNT (w) */
    Ifx_UReg_32Bit RST_PD_CNT:1;      /**< \brief [3:3] Reset Predivider Counter - RST_PD_CNT (w) */
    Ifx_UReg_32Bit reserved_4:12;     /**< \brief [15:4] \internal Reserved */
    Ifx_UReg_32Bit WD_PREDIV:16;      /**< \brief [31:16] Watchdog Counter Predivider - WD_PREDIV (rw) */
} Ifx_CIF_WD_CTRL_Bits;

/** \brief Watchdog Horizontal Timeout Register */
typedef struct _Ifx_CIF_WD_H_TIMEOUT_Bits
{
    Ifx_UReg_32Bit WD_HSE_TO:16;      /**< \brief [15:0] Watchdog Horizontal Start End Timeout - WD_HSE_TO (rw) */
    Ifx_UReg_32Bit WD_HES_TO:16;      /**< \brief [31:16] Watchdog Horizontal End Start Timeout - WD_HES_TO (rw) */
} Ifx_CIF_WD_H_TIMEOUT_Bits;

