HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_regdef.h
/** \brief Memory Interface Offset Counter Start Value for Extra Path ${j} Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START;

/** \brief Memory Interface Size of Extra Path ${j} Data Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_SIZE_INIT;

/** \brief Memory Interface Size Shadow Register of Extra Path ${j} Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_SIZE_SHD;

/** \brief MI Extra Path Interrupt Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_ICR_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_MIEP_ICR;

/** \brief MI Extra Path Interrupt Mask \u20181\u2019: interrupt active, \u20180\u2019: interrupt masked   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_IMSC_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_MIEP_IMSC;

/** \brief MI Extra Path Interrupt Set Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_ISR_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_MIEP_ISR;

/** \brief MI Extra Path Masked Interrupt Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_MIS_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_MIEP_MIS;

/** \brief MI Extra Path Raw Interrupt Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_RIS_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_MIEP_RIS;

/** \brief Extra Path Error Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_STA_ERR_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_MIEP_STA_ERR;

/** \brief Extra Path Status Error Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_STA_ERR_CLR_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_STA_ERR_CLR;

/** \brief Memory Interface Counter Value of JPEG or RAW Data Bytes Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_BYTE_CNT_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_MI_BYTE_CNT;

/** \brief Memory Interface Global Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_CTRL_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_MI_CTRL;

/** \brief Memory Interface Global Control Internal Shadow Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_CTRL_SHD_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_MI_CTRL_SHD;

/** \brief MI Interrupt Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_ICR_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_MI_ICR;

/** \brief MI Interrupt Mask \u20181\u2019 interrupt active \u20180\u2019 interrupt masked   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_IMSC_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_MI_IMSC;

/** \brief Memory Interface Control Register For Address Init And Skip Function Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_INIT_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_MI_INIT;

/** \brief MI Interrupt Set Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_ISR_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_MI_ISR;

/** \brief MI Masked Interrupt Status Registe   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MIS_Bits B;            /**< \brief Bitfield access */
} Ifx_CIF_MI_MIS;

/** \brief Memory Interface Base Address For Main Picture Cb Component Ring Buffer Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_BASE_AD_INIT;

/** \brief Memory Interface Base Address Shadow Register For Main Picture Cb Component Ring Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_CIF_MI_MP_CB_BASE_AD_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MI_MP_CB_BASE_AD_SHD;

